text = {
    (2,0,0): "22:00. Вы чувствуете себя так, будто не спали несколько лет. От проведенных нескольких часов подряд за дз у вас начала кружиться голова."
    " В последнее время вы даже стали видеть странные сны, где приходите в деканат и пишите заявление об отчислении.",
    (2,0,1): "22:00. Вы чувствуете себя так, будто не спали несколько лет. От проведенных нескольких часов подряд за дз у вас начала кружиться голова."
    " В последнее время вы даже стали видеть странные сны, где приходите в деканат и пишите заявление об отчислении."










}


btn = {
    (2,0,1):['выпить с ванютиксом', (2,1,0)],
    (2,0,2):['выпить с ванютиксом', (2,1,0)]
}


mx = {
    (2,0) : 1,
    (2,1) : 0
}