text1 = {
    (1, 0, 0): "Время на телефоне - 23:47. ",

    (1, 0, 1): "За целое воскресенье вы успели открыть и почти сразу же закрыть презентацию по дискретной математике, проведя день довольно продуктивно. ",

    (1, 0, 2): "Сейчас же вы чувствуете, что пора закругляться, ведь уже в 8 утра вам нужно в абсолютно бодром и энергичном состоянии присутствовать на парах.",

    (1, 0, 3): "Тем не менее, пока вы сидели в телефоне, вам в глаза бросилась иконка приложения ТикТок, нагло поставив перед вами весьма тяжелый выбор. ",

    (1, 0, 4): "С одной стороны, вам нужно нормально выспаться, чтобы не клевать носом на парах и понять замудренные теоремы на матанализе... ",

    (1, 0, 5): "Но с другой, вы же заслужили возможность отдохнуть, не так ли?",

    (1, 1, 0): "Действительно, сон дома в разы лучше, чем сон на паре. Вы выключаете свет и ложитесь в теплую постель в предвкушении самого счастливого времени суток. "
               "Взяв в руки телефон, вы стали размышлять о своих способностях просыпаться с первого же будильника. ",

    (1, 1, 1): "Однако в квартире вы живете не один, поэтому будить весь дом непрекрающимся звоном будильника вам кажется не очень приемлемым. ",

    (1, 2, 0): "Ничего страшного, времени достаточно, чтобы выспаться. С абсолютно спокойной душой вы ставите будильник на 6:40 и кладете телефон рядом с подушкой. "
               "Вы закрыли глаза. Все ваши мысли в голове медленно покидают сознание, уходя куда-то очень далеко.",

    (1, 2, 1): "Странно. Ваше мутное сознание не покидает ощущение, что вы спите дольше, нужно. Подозрительно, что будильник до сих пор не прозвенел. "
               "С внезапным наплывом тревоги вы открываете глаза и резко хватаете телефон. Время на экране - 7:34.",

    (1, 2, 2): "Вы раздраженно выдыхаете и бросаете телефон в сторону. Действительно неприятно, однако чего вы ожидали? "
               "Вам еще крайне повезло, что вы не проснулись в час дня. В спешке вы начали собираться, метаясь по всей квартире. ",

    (1, 2, 3): "За 10 минут вы привели внешний вид в порядок. К счастью, у вас осталось достаточно времени, чтобы вылететь пулей из дома и в бешеном темпе побежать на остановку. "
               "Причем завтраком, очевидно, придется пожертвовать",

    (1, 2, 4): "Неприятное ощущение. Вы не ели аж с прошлого вечера. Живот предательски заурчал. А стоит ли оно того?",

    (1, 3, 0): "Ваша потребность в еде оказалась сильнее стремления быть прилежным студентом. В надежде успеть утолить голод до начала пары вы метнулись к холодильнику.",

    (1, 3, 1): "К сожалению, возможности в полной мере насладиться едой не было, поэтому пришлось есть так, будто вы питаетесь в последний раз в этой жизни. "
               "Вы бросаете взгляд на настенные часы на кухне - 7:55. ",

    (1, 3, 2): "Быстрым шагом вы идете за своими вещами, а затем чуть ли не выбегаете из квартиры.",

    (1, 3, 3): "Вы не помните, закрыли ли вы дверь в квартиру, но это уже не имеет значения. Лифт едет предательски долго. Вы выходите из подъезда и изо всех сил бежите на остановку. ",

    (1, 3, 4): "Вам повезло, что автобус приехал сразу же, как вы добрались до нее.",

    (1, 3, 5): "Вы почти дошли до аудитории. Отдышка так и не уходит. Сердце стучит настолько сильно, что вам кажется, будто оно собирается вырваться наружу."
               "Судорожно вы достали телефон из кармана. 8:15. ",

    (1, 3, 6): "Что ж, раз вы уже здесь, то терять нечего. Несколько секунд вы просто стоите, пытаясь набраться сил и принять неизбежное. "
               "Получается плохо. Тем не менее дрожащей рукой вы тянетесь к ручке двери в аудиторию.",

    (1, 3, 7): "Как только вы открыли ее, мигом все любопытные взгляды от доски перешли к вам. В том числе и пристальный взгляд В.В. Чистякова.",

    (1, 3, 8): "Кажется, он вас запомнил. И до конца сессии забывать точно не собирается.",

    (1, 4, 0): "Не может быть, чтобы вся эта спешка была ни к чему. Поборов желание наброситься на еду, вы взяли свои вещи и вышли из квартиры. ",

    (1, 4, 1): "До начала пары оставалось 2 минуты. Хотя все первые ряды в аудитории уже были давно заняты, вы все равно были раду тому, что не попались на глаза преподавателю. "
               "Гордость за собственные усилия пронизывает всю вашу душу.",

    (1, 5, 0): "Действительно, здесь лучше не рисковать. Даже несмотря на то, что утром вы разбудите весь дом. "
               "С абсолютно спокойной душой и уверенный в завтрашнем дне вы ставите несколько будильников и кладете телефон рядом с подушкой. ",

    (1, 5, 1): "Вы закрыли глаза. ",

    (1, 5, 2): "Все ваши мысли в голове медленно покидают сознание, уходя куда-то очень далеко.",

    (1, 5, 3): "Звенит уже третий будильник. К счастью, вы приняли верное решение, благодаря чему проснулись вовремя. "
               "Вы сделали все необходимые утренние дела в спокойном темпе и вышли из дома.",

    (1, 5, 4): "Пока шли на остановку, вы почувствовали, как глаза закрываются сами по себе. Вы были готовы лечь прямо на асфальте и проспать так часов 7 минимум.",

    (1, 5, 5): "Со своими синяками под глазами вы были похожи на настоящую панду. А люди при виде вас думали, что вы либо болеете, либо просто алкоголик.",

    (1, 5, 6): "Пожалуй, так дело не пойдет, иначе вы действительно заснете по дороге до корпуса.",

    (1, 6, 0): "Вы зашли в ближайшую пятерочку и купили большую бутылку энергетика. Его определенно должно хватить до конца учебного дня. ",

    (1, 6, 1): "Сделав всего лишь один глоток, вы уже почувствовали себя намного бодрее. Даже желание жить снова вернулось к вам. ",

    (1, 6, 2): "Вы направились к остановке.",

    (1, 6, 3): "До конца пары осталось несколько минут. "
               "Благодаря энергетику, который вы пили практически без остановки, вы смогли не уснуть прямо перед лицом преподавателя и даже усвоить весь материал.",

    (1, 7, 0): "Так как вы чересчур уверенный в себе человек, вы поверили в собственные силы и возможности и решились обойтись без энергетика. Ваша смелость действительно поражает. ",

    (1, 7, 1): "Тем не менее все же вы обычный студент, а значит тратить деньги куда попало не стоит, иначе придется весь оставшийся месяц до стипендии питаться хлебом с майонезом. ",

    (1, 7, 2): "С полузакрытыми глазами, иногда врезаясь в прохожих, вы поплелись дальше до остановки. ",

    (1, 7, 3): "Нужный автобус не заставил себя долго ждать. Зайдя в него, вы тут же обнаружили несколько свободных мест.",

    (1, 7, 4): "Вы решили подарить себе пару минут счастья и заняли одно из них. Ни в коем случае нельзя терять такую возможность, ведь полупустой автобус - настоящая редкость. ",

    (1, 7, 5): "Тем временем сон так и хотел завладеть вами полностью. Глаза сами закрывались, сколько бы усилий вы не прикладывали, чтобы открыть их. "
               "Как же сильно они болели, когда вы держали их раскрытыми хоть секунду. ",

    (1, 7, 6): "Не в силах больше бороться с естественной потребностью организма бедного студента, вы все же решили погрузиться в сон совсем ненадолго.",

    (1, 7, 7): "Ничего же не случится, если вы закроете глаза на какие-то жалкие пару секунд, не так ли?",

    (1, 7, 8): "Вы чувствуете себя просто прекрасно.",

    (1, 7, 9): "Вы уже представляете, как встанете с кровати прямо сейчас и начнете спокойно собираться на учебу. ",

    (1, 7, 10): "Вы слышите, как сосед зовет вас и пытается разбудить. ",

    (1, 7, 11): "Странно, ведь он никогда так раньше не делал. Вы медленно открываете глаза. ",

    (1, 7, 12): "Однако мутный вид вашей комнаты меняется на... ",

    (1, 7, 13): "автобус? ",

    (1, 7, 14): "Вы слышите голос кондукторши.",

    (1, 7, 15): "- Молодой человек, просыпайтесь, мы на конечной остановке!",

    (1, 7, 16): "Кажется, автомат вам точно не видать.",

    (1, 8, 0): "Абсолютно верно. Выспаться вы еще успеете, а сейчас есть дела поважнее. "
               "К тому же, от того, что вы полистаете ТикТок 15 минут, ничего с вами не случится.",

    (1, 8, 1): "На часах 5 утра. Вы начинаете чувствовать, как вас клонит в сон. Кажется, пора действительно заканчивать. "
               "Все же поспать полтора часа намного лучше, чем не спать совсем. ",

    (1, 8, 2): "Чтобы точно спасти себя от опоздания, вы ставите несколько будильников и уверенный в том, что не проспите, ложитесь спать. ",

    (1, 8, 3): "Странно.",

    (1, 8, 4): "Ваше мутное сознание не покидает ощущение, что вы спите дольше, нужно. ",

    (1, 8, 5): "Подозрительно, что будильник до сих пор не прозвенел. С внезапным наплывом тревоги вы открываете глаза и резко хватаете телефон. ",

    (1, 8, 6): "Время на экране - 7:34. Вы раздраженно выдыхаете и бросаете телефон в сторону.",

    (1, 8, 7): "Действительно неприятно, однако чего вы ожидали? Вам еще крайне повезло, что вы не проснулись в час дня. ",

    (1, 8, 8): "В спешке вы начали собираться, метаясь по всей квартире. За 10 минут вы привели внешний вид в порядок.",

    (1, 8, 9): "К счастью, у вас осталось достаточно времени, чтобы вылететь пулей из дома и в бешеном темпе побежать на остановку. "
               "Причем завтраком, очевидно, придется пожертвовать. Неприятное ощущение. ",

    (1, 8, 10): "Вы не ели аж с прошлого вечера. ",

    (1, 8, 11): "Живот предательски заурчал. ",

    (1, 8, 12): "А стоит ли оно того?",

    (1, 9, 0): "Ваша потребность в еде оказалась сильнее стремления быть прилежным студентом. В надежде успеть утолить голод до начала пары вы метнулись к холодильнику.",

    (1, 9, 1): "К сожалению, возможности в полной мере насладиться едой не было, поэтому пришлось есть так, будто вы питаетесь в последний раз в этой жизни. "
               "Вы бросаете взгляд на настенные часы на кухне - 7:55. ",

    (1, 9, 2): "Быстрым шагом вы идете за своими вещами, а затем чуть ли не выбегаете из квартиры.",

    (1, 9, 3): "Вы не помните, закрыли ли вы дверь в квартиру, но это уже не имеет значения. Лифт едет предательски долго. Вы выходите из подъезда и изо всех сил бежите на остановку. ",

    (1, 9, 4): "Вам повезло, что автобус приехал сразу же, как вы добрались до нее.",

    (1, 9, 5): "Вы почти дошли до аудитории. Отдышка так и не уходит. Сердце стучит настолько сильно, что вам кажется, будто оно собирается вырваться наружу."
               "Судорожно вы достали телефон из кармана. 8:15. ",

    (1, 9, 6): "Что ж, раз вы уже здесь, то терять нечего. Несколько секунд вы просто стоите, пытаясь набраться сил и принять неизбежное. "
               "Получается плохо. Тем не менее дрожащей рукой вы тянетесь к ручке двери в аудиторию.",

    (1, 9, 7): "Как только вы открыли ее, мигом все любопытные взгляды от доски перешли к вам. В том числе и пристальный взгляд В.В. Чистякова.",

    (1, 9, 8): "Кажется, он вас запомнил. И до конца сессии забывать точно не собирается.",

    (1, 10, 0): "Не может быть, чтобы вся эта спешка была ни к чему. Поборов желание наброситься на еду, вы взяли свои вещи и вышли из квартиры. ",

    (1, 10, 1): "До начала пары оставалось 2 минуты. Хотя все первые ряды в аудитории уже были давно заняты, вы все равно были раду тому, что не попались на глаза преподавателю. "
               "Гордость за собственные усилия пронизывает всю вашу душу.",


}

btn1 = {

    (1, 0, 1): ["Да", (1, 1, 0)],
    (1, 1, 1): ["1", (1, 2, 0)],
    (1, 2, 1): ["Да", (1, 3, 0)],
    (1, 2, 2): ["Нет", (1, 4, 0)],
    (1, 1, 2): ["Несколько", (1, 5, 0)],
    (1, 5, 1): ["Да", (1, 6, 0)],
    (1, 5, 2): ["Нет", (1, 7, 0)],
    (1, 0, 2): ["Сидеть в тиктоке", (1, 8, 0)],
    (1, 8, 1): ["Да", (1, 9, 0)],
    (1, 8, 2): ["Нет", (1, 10, 0)]

}

mx1 = {
    (1, 0): 5,
    (1, 1): 1,
    (1, 2): 4,
    (1, 3): 8,
    (1, 4): 1,
    (1, 5): 6,
    (1, 6): 3,
    (1, 7): 16,
    (1, 8): 12,
    (1, 9): 8,
    (1, 10): 1

}
