text2 = {
    (2, 0, 0): "",




}

btn2 = {
    (2, 0, 1): ["Да", (2, 1, 0)],
    (2, 1, 1): ["Начать делать дискретку - Лох", (2, 2, 0)],
    (2, 2, 1): ["90", (2, 3, 0)],
    (2, 3, 1): ["Смотреть в окно", (2, 4, 0)],
    (2, 3, 2): ["Залипнуть в телефоне", (2, 5, 0)],
    (2, 5, 1): ["Купить билеты на Мальдивы", (2, 6, 0)],
    (2, 5, 2): ["Поехать на пару по матанализу", (2, 7, 0)],
    (2, 2, 2): ["9", (2, 8, 0)],
    (2, 1, 2): ["Пойти спать - Сигма", (2, 9, 0)],
    (2, 9, 1): ["Автобус", (2, 10, 0)],
    (2, 10, 1): ["90", (2, 11, 0)],
    (2, 11, 1): ["Смотреть в окно", (2, 12, 0)],
    (2, 11, 2): ["Залипнуть в телефоне", (2, 13, 0)],
    (2, 13, 1): ["Купить билеты на Мальдивы", (2, 14, 0)],
    (2, 13, 2): ["Поехать на пару по матанализу", (2, 15, 0)],
    (2, 10, 2): ["9", (2, 16, 0)],
    (2, 9, 2): ["Метро", (2, 17, 0)],
    (2, 17, 1): ["Автобус", (2, 18, 0)],
    (2, 18, 1): ["Да", (2, 19, 0)],
    (2, 18, 2): ["Нет", (2, 20, 0)],
    (2, 17, 2): ["Пешком", (2, 21, 0)],
    (2, 21, 1): ["Принять предложение Бориса Игоревича", (2, 22, 0)],
    (2, 21, 2): ["Отказаться от предложения", (2, 23, 0)],
    (2, 0, 2): ["Нет", (2, 24, 0)],
    (2, 24, 1): ["Начать делать дискру", (2, 25, 0)],
    (2, 25, 1): ["Да", (2, 26, 0)],
    (2, 26, 1): ["Да", (2, 27, 0)],
    (2, 26, 2): ["Нет", (2, 28, 0)],
    (2, 25, 2): ["Нет", (2, 29, 0)]

}

mx2 = {
    (2, 0): 12
}
